#include "picture.h" //加入绘图头文件 

int main()
{
  Cmd.BackColor("1E");//设置背景色
  cout<<"         将进酒\n\n";
  Speech.Speak("将进酒");  //计算机发声
  cout<<"君不见黄河之水天上来，奔流到海不复回。\n";
  Speech.Speak("君不见黄河之水天上来，奔流到海不复回。");
  cout<<"君不见高堂明镜悲白发，朝如青丝暮成雪。\n";
  Speech.Speak("君不见高堂明镜悲白发，朝如青丝暮成雪。");
  cout<<"人生得意须尽欢，莫使金樽空对月。\n";
  Speech.Speak("人生得意须尽欢，莫使金樽空对月。      ");
  cout<<"天生我材必有用，千金散尽还复来。\n";
  Speech.Speak("天生我材必有用，千金散尽还复来。      ");
  cout<<"烹羊宰牛且为乐，会须一饮三百杯。 \n";
  Speech.Speak("烹羊宰牛且为乐，会须一饮三百杯。      ");
  cout<<"岑夫子，丹丘生，将进酒，杯莫停。\n";
  Speech.Speak("岑夫子，丹丘生，将进酒，杯莫停。      ");
  cout<<"与君歌一曲，请君为我倾耳听。\n";
  Speech.Speak("与君歌一曲，请君为我倾耳听。          ");
  cout<<"钟鼓馔玉不足贵，但愿长醉不复醒。\n";
  Speech.Speak("钟鼓馔玉不足贵，但愿长醉不复醒。      ");
  cout<<"古来圣贤皆寂寞，惟有饮者留其名。\n";
  Speech.Speak("古来圣贤皆寂寞，惟有饮者留其名。      ");
  cout<<"陈王昔时宴平乐，斗酒十千恣欢谑。\n";
  Speech.Speak("陈王昔时宴平乐，斗酒十千恣欢谑。      ");
  cout<<"主人何为言少钱，径须沽取对君酌。\n";
  Speech.Speak("主人何为言少钱，径须沽取对君酌。      ");
  cout<<"五花马，千金裘，\n";
  Speech.Speak("五花马，千金裘，                      ");
  cout<<"呼儿将出换美酒，与尔同销万古愁。\n";
  Speech.Speak("呼儿将出换美酒，与尔同销万古愁。      ");
  Win.Show();//启动绘图窗口
}

