#include "picture.h" //加入绘图头文件 

int main()
{
  //---------------------01----------------------
//  cout<<"hello";
//  /*  Cmd.Input();
//    Model.Teapot(50,0);//显示大小为50，0为线条的茶壶
//    Win.Run(10,1);//绘图窗体内的物体旋转
//    Win.Name("balala");//设置绘图窗体标题名,c为字符数组
//    Pen.Show(0);//隐藏画笔
//    Win.Info(0);//关闭绘图窗体的提示文字
//    Win.Size(400,500);//设置绘图窗体长和宽*/
//  //Win.FullScreen();//设置绘图窗体全屏
//  Win.Cout("test");//绘图窗体输出文字
//  Win.Show();//启动绘图窗口

  //---------------------02----------------------

  Win.Name("两颗并排的树");//设置绘图窗体标题名,c为字符数组
  Pen.Color(0,255,0);//画笔颜色为三原色
  //Win.BackColor(128,127,255);//设置绘图窗体背景色
  Win.Cout("      *         *          ");//绘图窗体输出文字
  Win.Cout("     ***       ***         ");
  Win.Cout("    *****     *****        ");
  Win.Cout("   *******   *******       ");
  Win.Cout("      *         *          ");
  Win.Cout("      *         *          ");

  Win.Show();//显示绘图窗体
}

