/* 
1057: 【入门】能被5整除且至少有一位数字是5的所有整数的个数

题目描述
找出1－N中能被5整除且至少有一位数字是5的所有整数的个数.N<32767
输入
输入只有一行，只有1个整数N。
输出
输出只有一行（这意味着末尾有一个回车符号），包括1个整数。
样例输入
9999
样例输出
1271

第一步： i 循环1~n的每个数
第二步： 判断如果i满足是5的倍数， 且至少有1个5
第三步：计数
*/

#include <iostream>
using namespace std;
int main()
{
  int i, n, w, q, b, s, g;
  int C = 0; //计数器
  cin >> n;
  for (i = 1; i <= n; i++)
  {
    //因为N<32767，按照5位数来设计
    w = i / 10000;
    q = i / 1000 % 10;
    b = i / 100 % 10;
    s = i / 10 % 10;
    g = i % 10;
    //cout << w << " " << q << " " << b << " " << s << " " << g << endl;
    if (i % 5 == 0 && (w == 5 || q == 5 || b == 5 || s == 5 || g == 5))
    {
      //cout<<i<<endl;
      C++;
    }
  }
  cout << C << endl;
  return 0;
}
