/* 【入门】爱因斯坦的数学题
题目描述
爱因斯坦出了一道这样的数学题：有一条长阶梯，
若每步跨2阶，则最最后剩一阶，若每步跨3 阶，则最后剩2阶，
若每步跨5阶，则最后剩4阶，若每步跨6阶则最后剩5阶。
只有每次跨7阶，最后才正好一阶不剩。请问这条阶梯最少共有多少阶？

输入
无

输出
这条阶梯最少的阶数 */
#include <bits/stdc++.h>
using namespace std;
int main() {
    //直到找到复合条件的数，跳出循环 
  int i=1;
  while(1){
      if(i%2==1&&i%3==2&&i%5==4&&i%6==5&&i%7==0){
          cout<<i;
          break;
      }
      i++;
  }

/*int i = 1;
  while(!(i%2==1&&i%3==2&&i%5==4&&i%6==5&&i%7==0)){    
    i++;  }
  cout << i; */

/*int i;
  for (i=1;!(i%2==1&&i%3==2&&i%5==4&&i%6==5&&i%7==0);i++) {  } 
  cout << i;*/
  
  return 0;
}