/*1385 - 【入门】有趣的数字图形
题目描述
输入一个整数n（n<10），输出n行n列的如下图所示的数字图形。

输入
一个整数n。（ 1 < n < 10 )
输出
一个方阵，每个数字的场宽为5。

样例
输入
4
输出
    1    3    8   20
    3    2    5   12
    8    5    3    7
   20   12    7    4
来源
二维数组

标签
二维数组
*/
#include <bits/stdc++.h>
using namespace std;
int main() {
  /*
--- 0  1  2  3
||
0   1  3  8 20
1   3  2  5 12
2   8  5  3  7
3  20 12  7  4

----j0 j1 j2 j3
i0  00 11 22 33
i1  10 21 32
i2  20 31
i3  30

----j0 j1 j2 j3
i0  00 11 22 33
i1  01 12 23
i2  02 13
i3  03
*/
  int i, j, n, a[20][20] = {0};
  cin >> n;
  for (i = 0; i < n; i++) {
    for (j = 0; j < n; j++) {
      if (i == 0)
        a[i + j][j] = j + 1;
      else {
        a[i + j][j] = a[i + j - 1][j] + a[i + j][j + 1];
        a[j][i + j] = a[j + 1][i + j] + a[j][i + j - 1];
      }
    }
  }
  //输出
  for (i = 0; i < n; i++) {
    for (j = 0; j < n; j++) {
      cout << setw(5) << a[i][j];
    }
    cout << endl;
  }
  return 0;
}
