/*1342 - 【入门】怎样种树？
题目描述
公园准备在小山上种桃树、梨树、苹果树，为了美观，总共准备种n棵树（n>=6且n一定是6的倍数），
要求三种树都得有，且每种树的数量都得是偶数，
桃树的数量不能比梨树的数量多，梨树的数量不能比苹果树的数量多。
请问有这三种树的数量分别有哪些可能的组合方法，
从少到多分别数出桃树、梨树、苹果数可能的数量组合，每行1个方案。（6.1.99）

输入
一个整数n（n>=6且是6的倍数）
输出
若干行的可能的组合方案，每行3个数，分别代表桃树、梨树、苹果树的可能的方案。

样例
输入
18
输出
2 2 14
2 4 12
2 6 10
2 8 8
4 4 10
4 6 8
6 6 6
来源
需要找规律的循环
标签
需要找规律的循环
*/
#include <bits/stdc++.h>
using namespace std;
int main() {
  int n;        // n棵树
  int i, j, k;  // i、j、k=桃树、梨树、苹果树
  cin >> n;
  /*   for (int i = 2; i <= n - 4; i += 2) {
      for (int j = 2; j <= n - i - 2; j += 2) {
        k = n - i - j;
        if (i <= j && j <= k) {
          cout << i << " " << j << " " << k << endl;
        }
      }
    } */
  for (int i = 2; i <= n / 3; i += 2) {          //因为i<j<k,i最多n/3
    for (int j = i; j <= (n - i) / 2; j += 2) {  // i<=j,j从i开始循环即可
      k = n - i - j;
      if (j <= k) {
        cout << i << " " << j << " " << k << endl;
      }
    }
  }
  return 0;
}
