/*1251 - 【入门】四个人的年龄求解
题目描述
张三、李四、王五、刘六他们四人的年龄是一个等差数列，且年龄相加是26，相乘是880，
请问这四个人可能的年龄分别是多少？（假设一个人的年龄范围在1~130之间）

输入
无

输出
按照由小到大输出四个人的年龄的可能的值，数与数用空格隔开，
每个可能的年龄方案一行，请输出所有可能的年龄方案！

来源
需要找规律的循环

标签
需要找规律的循环
*/
#include <bits/stdc++.h>
using namespace std;
int main() {
  int n = 26;
  // i,j,k,l：四个人年龄
  for (int i = 1; i <= n; i++) {
    for (int j = i + 1; j <= n - i - 2; j++) {
      for (int k = j + 1; k <= n - i - j - 1; k++) {
        int l = n - i - j - k;
        if (l - k == k - j && k - j == j - i && i * j * k * l == 880) {
          cout << i << " " << j << " " << k << " " << l << endl;
        }
      }
    }
  }

  return 0;
}
