/*1158 - 【入门】输出奇数和偶数
题目描述
输入n个整数，将其中的奇数和偶数分别显示出来（1 < n < 30）

输入
第一行：一个整数n。第二行：n个空格隔开的整数。
输出
第一行：若干个奇数。第二行：若干个偶数。（每个数前面都有一个空格）

样例
输入
10
21 12 33 43 59 68 77 18 19 40
输出
21 33 43 59 77 19
12 68 18 40
来源
数组问题

标签
数组问题
*/
#include <bits/stdc++.h>
using namespace std;
int main() {
  int i, a[30], n;
  cin >> n;  //读实际元素的个数
  for (i = 0; i < n; i++) {
    cin >> a[i];
  }
  for (i = 0; i < n; i++) {
    if (a[i] % 2 != 0) {
      cout << a[i] << " ";
    }
  }
  cout << endl;
  for (i = 0; i < n; i++) {
    if (a[i] % 2 == 0) {
      cout << a[i] << " ";
    }
  }
  return 0;
}
