/*1009 - 【入门】数组逆序
题目描述
给你m个整数，将其逆序输出。

输入
第一行一个整数m（3 <= m <= 100 )：数的个数
第二行m个整数（空格隔开）（这些数在0-106之间)。

输出
m个整数（空格隔开）。

样例
输入
3
1 7 5
输出
5 7 1
来源
数组问题

标签
数组问题
*/
#include <bits/stdc++.h>
using namespace std;
int main() {
  int a[100], n;
  cin >> n;  //数组实际元素个数
  //读入数组的n个元素
  for (int i = 0; i < n; i++) {
    cin >> a[i];
  }
  /*
  //解法一：不真正逆序，而是直接倒序输出
   for (int i = n - 1; i >= 0; i--) {
     cout << a[i] << " ";
   } */

  //解法二：逆序：循环数组长度一半，对称位置交换
  for (int i = 0; i < n / 2; i++) {
    //通过归纳法得知：下标为i的元素和下标为n-1-i的元素交换
    int t = a[i];
    a[i] = a[n - 1 - i];
    a[n - 1 - i] = t;
  }
  //输出数组元素
  for (int i = 0; i < n; i++) {
    cout << a[i] << " ";
  }
  return 0;
}