/*1275 - 【入门】输出杨辉三角的前N行
题目描述
输出杨辉三角的前N行(N<10)。

输入
输入只有一行，包括1个整数N。(N<10)

输出
输出只有N行.

样例
输入
5
输出
1
1 1
1 2 1
1 3 3 1
1 4 6 4 1
来源
二维数组

标签
二维数组
*/
#include <bits/stdc++.h>
using namespace std;
int main() {
  //将二维数组的默认初始值清零
  int a[10][10] = {0}, n, i, j;
  cin >> n;
  //先循环行
  for (i = 0; i < n; i++) {
    //下标为i的那行,有i+1个数
    for (j = 0; j <= i; j++) {
      //如果是该行的第一列
      if (j == 0) {
        a[i][j] = 1;
      } else {
        //该数=该数上方数+该数上方左侧数
        a[i][j] = a[i - 1][j] + a[i - 1][j - 1];
      }
    }
  }
  //输出数组元素
  for (i = 0; i < n; i++) {
    for (j = 0; j <= i; j++) {
      cout << a[i][j] << " ";
    }
    cout << endl;
  }
}