/*1207 - 【入门】有趣的数字图形IV
题目描述
输入一个整数n（n≤12），打印出如下要求的方阵：除掉右上到左下对角线上的数外的右下半个区域中每个元素等于左边的和上面的元素之和。每个元素场宽为5。左上半个区域为空。

输入
一个整数n（n≤12）

输出
n*n的方阵（场宽为5）。

样例
输入
4
输出
                   4
              3    7
         2    5   12
    1    3    8   20
来源
二维数组

标签
二维数组
*/
#include <bits/stdc++.h>
using namespace std;
int main() {
  /*
---0  1  2  3
||
0           4
1        3  7
2     2  5 12
3  1  3  8 20

----j0 j1 j2 j3
i0  30 21 12 03
i1  31 22 13
i2  32 23
i3  33
*/
  int a[20][20] = {0}, i, j, n;
  cin >> n;
  //循环赋值的次数
  for (i = 0; i < n; i++) {
    for (j = 0; j < n - i; j++) {
      if (i == 0)
        a[n - j - 1][i + j] = j + 1;
      else
        a[n - j - 1][i + j] = a[n - j - 1][i + j - 1] + a[n - j - 1 - 1][i + j];
    }
  }
  //输出
  for (i = 0; i < n; i++) {
    for (j = 0; j < n; j++) {
      if (a[i][j] == 0)
        cout << setw(5) << " ";
      else
        cout << setw(5) << a[i][j];
    }
    cout << endl;
  }
  return 0;
}
