/*1195 - 【入门】斜角IV
题目描述
输入整数N，输出相应方阵。

输入
一个整数N。（ 0 < n < 10 )

输出
一个方阵，每个数字的场宽为3。

样例
输入
5
输出
  5  4  3  2  1
  4  5  4  3  2
  3  4  5  4  3
  2  3  4  5  4
  1  2  3  4  5
来源
二维数组

标签
二维数组
*/
#include <bits/stdc++.h>
using namespace std;
int main() {
  /*
---0  1  2  3  4
||
0  5  4  3  2  1
1  4  5  4  3  2
2  3  4  5  4  3
3  2  3  4  5  4
4  1  2  3  4  5

    j0 j1 j2 j3 j4
i0  04
i1  03 14
i2  02 13 24
i3  01 12 23 34
i4  00 11 22 33 44

i0  40
i1  30 41
i2  20 31 42
i3  10 21 32 43
i4  00 11 22 33 44
*/
  int a[20][20] = {0}, i, j, n;
  cin >> n;
  //循环赋值的次数
  for (i = 0; i < n; i++) {
    for (j = 0; j <= i; j++) {
      a[j][n - i - 1 + j] = i + 1;  //左下角
      a[n - i - 1 + j][j] = i + 1;  //右上角
    }
  }
  //输出
  for (i = 0; i < n; i++) {
    for (j = 0; j < n; j++) {
      cout << setw(3) << a[i][j];
    }
    cout << endl;
  }
  return 0;
}
