/*1306 - 【基础】十六进制转二进制
题目描述
请将一个不超过100位的十六进制数转换为二进制数！

输入
一个不超过100位的十六进制整数

输出
该数对应的二进制数！

样例
输入
123456789ABCDEF
输出
100100011010001010110011110001001101010111100110111101111
来源
进制转换

标签
进制转换
*/
#include <bits/stdc++.h>
using namespace std;
string t[16] = {"0000", "0001", "0010", "0011", "0100", "0101", "0110", "0111",
                "1000", "1001", "1010", "1011", "1100", "1101", "1110", "1111"};
int main() {
  // s:存放16进制,r:存放2进制
  string s, r;
  cin >> s;
  // s = "1A5"
  // s[i]转换为0~15之间的整数, 然后再求对应的4位2进制
  int x;
  for (int i = 0; i < s.size(); i++) {
    //如果是0~9
    if (isdigit(s[i])) {
      x = s[i] - '0';
    } else {
      x = s[i] - 'A' + 10;
    }
    // cout<<x<<end1;
    r = r + t[x];
  }
  //删除前导 0
  // 0001101011111
  //当r[0]是'0',则删除
  while (r[0] == '0') {
    r.erase(0, 1);
  }
  if (r == "") {
    cout << 0;
  } else {
    cout << r;
  }
}