/*1294 - 【基础】二进制转十六进制
题目描述
请将一个不超过100位的二进制数转换为十六进制数！

输入
一个不超过100位的二进制整数

输出
该数对应的十六进制数！

样例
输入
11001001111011111000001000010011
输出
C9EF8213
来源
进制转换

标签
进制转换
*/
#include <bits/stdc++.h>
using namespace std;

/*
1.判断字符串长度是否是4的倍数，如果不是补0
2.将每4位的2进制转换为1位的16进制，输出
*/
string s;  //存放2进制
string t = "0123456789ABCDEF";
int main() {
  cin >> s;
  //如果长度不是4的倍数，补0
  // 11010
  if (s.size() % 4 == 1)
    s = "000" + s;
  else if (s.size() % 4 == 2)
    s = "00" + s;
  else if (s.size() % 4 == 3)
    s = "0" + s;

  // cout<<s<<endl;
  //计算
  // 0101,1010
  for (int i = 0; i < s.size(); i = i + 4) {
    //将4位的2进制：s[i] s[i+1] s[i+2] s[i+3]
    //转16进制
    int x = (s[i + 3] - '0') * 1 + (s[i + 2] - '0') * 2 + (s[i + 1] - '0') * 4 +
            (s[i] - '0') * 8;
    cout << t[x];
  }
}